### 튜플

In [2]:
# 수정가능

PriceList = [100,200,150,170]

PriceList[0] = 190

In [11]:
PriceList

[190, 200, 150, 170]

In [7]:
# 수정 불가능

PriceTuple = {100,200,150,170}

PriceTuple[0] = 190

In [10]:
PriceTuple

{100, 150, 170, 200}

In [8]:
PriceSet = set(PriceList)

In [ ]:
PriceTuple1 = {100,200,150,170}

In [ ]:
PriceSet1 = {100,150,200,170}
PriceSet2 = {100,139,210,170}
PriceSet3 = {100,139,200,150}

In [ ]:
PriceSet1.intersection # (교집합)
PriceSet2.union # (합집합)
PriceSet3.difference # (차집합)

In [ ]:
allWeek = {1,2,3,4,5,6}

In [ ]:
existWeek = {1,2,3,5,6}

### 딕셔너리 key, value 형태로 저장을 한다.

In [1]:
PriceSet = [10,20,30,40]
PriceSet = {"price", 20, 30, 40}

In [ ]:
priceList = [10,20,30,40]

In [2]:
yearweekList = [202021,202002,202003,202004]

valueDict["regionid] = ["A01", "A01", "A01","A01"]

In [4]:
priceDict {"price": priceList,
           "yearweek": yearweekList}

priceDict["price"]

import pandas as pd

pd.DataFatme(priceDict)

###### dic = {"name":"sec","id":"300000","address":"suwon"}에서 “id”:”300000” 삭제하여 출력하세요{'name': 'sec', 'address': 'suwon’}

In [11]:
dic = {"name":"sec","id":"300000","address":"suwon"}

dic.keys() # {'name': 'sec', 'id': '300000', 'address': 'suwon'} 

dic.pop("id") # "id" 요소 삭제

dic # 출력 {'name': 'sec', 'address': 'suwon'}

{'name': 'sec', 'address': 'suwon'}

In [13]:
import pandas as pd

In [21]:
indata = pd.read_csv("../dataset/customerdata.csv")

In [22]:
indata.head()

   CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566  4273.900000    3            6    1.679181  Big-Screen-lover
1  A14219  3642.441950    2            4    2.682023      Sleeping-dog
2  A15312  3653.884565    2            5    3.208202      Sleeping-dog
3  A16605  3713.211107    2            6    0.900000        Early-bird
4  B10634  3391.074215    2            4    2.453656      Sleeping-dog

In [ ]:
indata.rename(columns=("CUSTID:CUSTID11")) # 키를 잡고 바꿈

### 데이터프레임 list

In [15]:
import pandas as pd

In [16]:
productIdList = ["LEDTV", "LEDTV", "LEDTV", "LEDTV"]
yearweekList = [202121,202102,202103,202104]
volValueList = [100, 120, 130, 140]

In [ ]:
# 테이블로 저장됨

In [9]:
pd.DataFrame(productId, columns=["product"])

  product
0   LEDTV
1   LEDTV
2   LEDTV
3   LEDTV

### 데이터프레임 list

##### list에서 데이터프레임 만들기

In [1]:
import pandas as pd

productIdList = ["LEDTV", "LEDTV", "LEDTV", "LEDTV"]
yearweekList = [202121,202102,202103,202104]
volValueList = [100, 120, 130, 140]

columnName = ["PRODUCT", "YEARWEEK", "VOLUME"]

pd.DataFrame( zip(productIdList,
                yearweekList,
                 volValueList), columns=columnName)

  PRODUCT  YEARWEEK  VOLUME
0   LEDTV    202121     100
1   LEDTV    202102     120
2   LEDTV    202103     130
3   LEDTV    202104     140

In [14]:
import pandas as pd

In [15]:
KSH = pd.DataFrame([
      ["A01", "202001", 100],
      ["A01", "202002", 12],
      ["A01", "202003", 130]])

In [16]:
KSH.rename(columns={0:"regionid",
                    1:"yearweek",
                    2:"sales"})

  regionid yearweek  sales
0      A01   202001    100
1      A01   202002     12
2      A01   202003    130

In [14]:
import numpy as np

In [5]:
np.linspace(start=1, stop=100, num=20)

array([  1.        ,   6.21052632,  11.42105263,  16.63157895,
        21.84210526,  27.05263158,  32.26315789,  37.47368421,
        42.68421053,  47.89473684,  53.10526316,  58.31578947,
        63.52631579,  68.73684211,  73.94736842,  79.15789474,
        84.36842105,  89.57894737,  94.78947368, 100.        ])

In [3]:
import numpy as np

In [25]:
np.random.randint(low=0, high=10, size=10)
np.random.randint(1,20,3)
np.random.randint(11)

10

In [4]:
r = np.random.random(size=10)
for i in range(0, len(r)):
    r[i] = int(r[i]*10)

In [5]:
r

array([7., 6., 5., 1., 9., 5., 6., 3., 9., 9.])

In [30]:
np.random.rand(3,2,3)

array([[[0.03511572, 0.33676477, 0.87580831],
        [0.42946219, 0.44384433, 0.12730153]],

       [[0.15750952, 0.3530058 , 0.73579241],
        [0.20418226, 0.4279013 , 0.35651538]],

       [[0.14785105, 0.99180483, 0.28951267],
        [0.90424377, 0.13485923, 0.88142819]]])

### 자신만의 데이터프레임 만들기

In [1]:
import pandas as pd

In [2]:
KSH = pd.DataFrame([
      [1, "김승현", 25],
      [2, "김승현1", 26],
      [3, "김승현2", 27]])

In [3]:
KSH.rename(columns={0:"NO",
                    1:"NAME",
                    2:"AGE"})

   NO  NAME  AGE
0   1   김승현   25
1   2  김승현1   26
2   3  김승현2   27

In [6]:
KSH

   0     1   2
0  1   김승현  25
1  2  김승현1  26
2  3  김승현2  27

In [21]:
import pandas as pd

In [22]:
noList = [1, 2, 3]
nameList = ["김승현", "김승현1", "김승현2"]
ageList = [25, 26, 27]

In [23]:
columnName = ["NO", "NAME", "AGE"]

In [24]:
my = pd.DataFrame( zip(noList, nameList, ageList), columns=columnName )

In [25]:
my

   NO  NAME  AGE
0   1   김승현   25
1   2  김승현1   26
2   3  김승현2   27

In [8]:
columns = ["no", "name", "age"]

In [9]:
my

   no  name  age
0   1   김승현   25
1   2  김승현1   26
2   3  김승현2   27